# -*- coding: utf-8 -*-
from bson import ObjectId
from flask import Blueprint
from flask import render_template


news = Blueprint("news", __name__)

@news.route("/", methods=['POST', 'GET'])
def get_summary():

    contents = [
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        },
        {
            'title': '辰安科技:签订海外大单,业绩更添保障',
            'cont': '辰安科技:签订海外大单,业绩更添保障'
        }

    ]
    return render_template('html-1/news.html',contents = contents)
